# Data Analysis with Python

## Pre-requisites

In [3]:
# Pre-requisite 1
# ---
# Importing pandas library for data manipulation
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [4]:
# Pre-requisite 2
# ---
# Importing numpy library for scientific computations
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

## 1. Data Exploration

### Examples

In [5]:
# Viewing top records of the dataset
# ---
# You have been given the following dataset on Ebola cases.
# Let's preview the first 10 rows.
# ---
# Dataset url = https://bit.ly/2T60DKG
# 
ebola_df = pd.read_csv('https://bit.ly/2T60DKG')
ebola_df.head(10)

  Country  Month  Year   Lat  Lon   Value
0  Guinea      3    14  9.95 -9.7   122.0
1  Guinea      4    14  9.95 -9.7   224.0
2  Guinea      5    14  9.95 -9.7   291.0
3  Guinea      6    14  9.95 -9.7   413.0
4  Guinea      7    14  9.95 -9.7   460.0
5  Guinea      8    14  9.95 -9.7   771.0
6  Guinea      9    14  9.95 -9.7  1022.0
7  Guinea     10    14  9.95 -9.7     NaN
8  Guinea     11    14  9.95 -9.7     NaN
9  Guinea     12    14  9.95 -9.7     NaN

In [6]:
# Viewing last records of the dataset
# ---
# Preview the last 10 records of the ebola dataset
# ---
# 
last_ebola_df = ebola_df.tail(10)
last_ebola_df

         Country  Month  Year    Lat    Lon   Value
21       Senegal      8    14  14.50 -14.45     1.0
22       Senegal      9    14  14.50 -14.45     3.0
23  Sierra Leone      5    14   8.46 -11.78    50.0
24  Sierra Leone      6    14   8.46 -11.78   239.0
25  Sierra Leone      7    14   8.46 -11.78   533.0
26  Sierra Leone      8    14   8.46 -11.78  1216.0
27  Sierra Leone      9    14   8.46 -11.78  1940.0
28  Sierra Leone     10    14   8.46 -11.78     NaN
29  Sierra Leone     11    14   8.46 -11.78     NaN
30  Sierra Leone     12    14   8.46 -11.78     NaN

In [7]:
# Taking a sample
# ---
# Take a sample of the 5 records from the ebola dataset
# ---
# 
sample_ebola_df = ebola_df.sample(5)
sample_ebola_df

         Country  Month  Year   Lat    Lon   Value
6         Guinea      9    14  9.95  -9.70  1022.0
4         Guinea      7    14  9.95  -9.70   460.0
9         Guinea     12    14  9.95  -9.70     NaN
28  Sierra Leone     10    14  8.46 -11.78     NaN
10       Liberia      4    14  6.43  -9.43    35.0

### <font color="green">Challenges</font>

In [8]:
# Challenge 1
# ---
# View the first 20 records of the given banknotes dataset 
# ---
# Dataset url = https://bit.ly/2yT9oAU
# ---
# OUR CODE GOES BELOW
# 
banknotes= pd.read_csv('https://bit.ly/2yT9oAU')
banknotes.head(20)

    conterfeit  Length   Left  Right  Bottom   Top  Diagonal
0            0   214.8  131.0  131.1     9.0   9.7     141.0
1            0   214.6  129.7  129.7     8.1   9.5     141.7
2            0   214.8  129.7  129.7     8.7   9.6     142.2
3            0   214.8  129.7  129.6     7.5  10.4     142.0
4            0   215.0  129.6  129.7    10.4   7.7     141.8
5            0   215.7  130.8  130.5     9.0  10.1     141.4
6            0   215.5  129.5  129.7     7.9   9.6     141.6
7            0   214.5  129.6  129.2     7.2  10.7     141.7
8            0   214.9  129.4  129.7     8.2  11.0     141.9
9            0   215.2  130.4  130.3     9.2  10.0     140.7
10           0   215.3  130.4  130.3     7.9  11.7     141.8
11           0   215.1  129.5  129.6     7.7  10.5     142.2
12           0   215.2  130.8  129.6     7.9  10.8     141.4
13           0   214.7  129.7  129.7     7.7  10.9     141.7
14           0   215.1  129.9  129.7     7.7  10.8     141.8
15           0   214.5  129.8  129.8     9.3   8.5     141.6
16           0   214.6  129.9  130.1     8.2   9.8     141.7
17           0   215.0  129.9  129.7     9.0   9.0     141.9
18           0   215.2  129.6  129.6     7.4  11.5     141.5
19           0   214.7  130.2  129.9     8.6  10.0     141.9

In [9]:
# Challenge 2
# ---
# View the last 5 records of the above banknotes dataset 
# ---
# OUR CODE GOES BELOW
# 
banknotes.tail(5)

     conterfeit  Length   Left  Right  Bottom   Top  Diagonal
195           1   215.0  130.4  130.3     9.9  12.1     139.6
196           1   215.1  130.3  129.9    10.3  11.5     139.7
197           1   214.8  130.3  130.4    10.6  11.1     140.0
198           1   214.7  130.7  130.8    11.2  11.2     139.4
199           1   214.3  129.9  129.9    10.2  11.5     139.6

In [10]:
# Challenge 3
# ---
# Get a sample of 50 records from the above banknotes dataset 
# ---
# OUR CODE GOES BELOW
# 
banknotes_sample=banknotes.sample(50)
print(banknotes_sample)

     conterfeit  Length   Left  Right  Bottom   Top  Diagonal
188           1   214.8  129.9  130.2     9.6  11.9     139.4
152           1   214.6  129.7  129.3    10.4  11.0     139.3
199           1   214.3  129.9  129.9    10.2  11.5     139.6
147           1   215.3  130.6  130.3     9.3  11.3     138.1
94            0   214.7  129.6  129.5     8.3  10.0     142.0
96            0   215.0  130.4  130.3     9.1  10.2     141.1
0             0   214.8  131.0  131.1     9.0   9.7     141.0
80            0   215.1  129.7  129.7     8.6  10.3     140.6
22            0   215.3  130.6  130.0     8.4  10.8     141.5
86            0   215.2  129.9  129.7     8.7   9.5     141.6
38            0   215.3  130.3  130.1     8.5   9.3     142.1
42            0   214.9  129.6  129.4     9.3   9.0     141.7
162           1   214.6  130.1  130.0    11.5  10.6     139.5
11            0   215.1  129.5  129.6     7.7  10.5     142.2
55            0   215.2  129.7  129.4     9.2   9.4     142.0
119           1   214.4  130.2  129.9    10.1  12.0     139.2
103           1   215.0  130.4  130.6     9.9  10.9     140.3
56            0   215.7  130.0  129.4     9.2  10.4     141.2
88            0   214.9  130.3  129.9     7.4  11.2     141.5
173           1   214.8  129.6  130.0    10.4  11.6     139.2
194           1   214.9  130.3  130.5    11.6  10.6     139.8
12            0   215.2  130.8  129.6     7.9  10.8     141.4
104           1   214.7  130.2  130.3    11.8  10.9     139.7
167           1   215.6  130.4  130.1     9.6  11.2     138.6
111           1   215.1  130.5  130.3    10.6  11.5     140.1
132           1   214.9  130.5  130.2    10.6  11.5     139.9
126           1   215.0  130.4  130.4     9.4  11.6     140.2
4             0   215.0  129.6  129.7    10.4   7.7     141.8
97            0   214.4  129.7  129.5     8.0  10.3     141.2
165           1   215.1  130.3  130.6    10.3  12.0     139.7
66            0   214.6  129.5  129.2     7.7  10.3     141.3
3             0   214.8  129.7  129.6     7.5  10.4     142.0
106           1   215.3  130.3  130.1     9.3  12.1     140.2
164           1   214.3  130.3  130.0    11.4  10.5     139.8
183           1   214.6  130.5  130.4    10.1  11.4     139.3
182           1   215.0  130.5  130.1    11.0  11.4     139.3
128           1   215.1  130.2  130.2    10.1  11.3     140.3
137           1   214.9  130.7  130.3     9.3  11.2     138.3
143           1   215.0  130.5  130.4    10.6  11.1     139.9
30            0   215.2  130.1  129.8     7.9  10.7     141.8
41            0   214.8  130.1  129.6     8.8   9.9     140.9
40            0   214.4  129.8  129.2     8.9   9.4     142.3
87            0   215.0  129.6  129.2     8.4  10.2     142.1
124           1   214.7  130.5  130.5     9.9  10.3     140.1
115           1   215.5  130.4  130.0     8.2  11.2     139.2
109           1   215.2  130.6  130.8    10.4  11.2     140.3
37            0   215.3  129.9  129.4     7.9  10.0     142.0
118           1   214.8  130.5  130.2    11.0  11.0     140.0
134           1   214.2  130.0  130.2    11.0  11.2     139.5
51            0   215.3  130.6  130.0     9.5   9.7     141.1

## 2. Selecting Columns I

### Examples

In [11]:
# Selecting a Column
# ---
# Select the first 5 values of the Value column from the previously used ebola dataset
# ---
# 
ebola_df_value = ebola_df[['Value']]
ebola_df_value.head()

   Value
0  122.0
1  224.0
2  291.0
3  413.0
4  460.0

In [12]:
# Selecting Multiple Columns I
# ---
# Select last 5 records from Country and Latitude column i.e. Lat, of the ebola dataset
# ---
#
ebola_df_country_lat = ebola_df[['Country', 'Lat']]
ebola_df_country_lat.tail()

# Method 2
# Uncomment the following lines
# ---
ebola_df_country_lat_method2 = ebola_df.iloc[:,0:4]
ebola_df_country_lat_method2.tail()

         Country  Month  Year   Lat
26  Sierra Leone      8    14  8.46
27  Sierra Leone      9    14  8.46
28  Sierra Leone     10    14  8.46
29  Sierra Leone     11    14  8.46
30  Sierra Leone     12    14  8.46

In [13]:
# Selecting Multiple Columns II
# ---
# Select last 5 records of the first 2 columns of the the ebola dataset
# ---
# 
ebola_df_country_bonus = ebola_df.iloc[:,0:2]
ebola_df_country_bonus.tail()

         Country  Month
26  Sierra Leone      8
27  Sierra Leone      9
28  Sierra Leone     10
29  Sierra Leone     11
30  Sierra Leone     12

### <font color="green">Challenges</font>

In [14]:
# Challenge 1
# ---
# Select the first 20 records of the Diagonal column in the given banknotes dataset.
# ---
# Dataset url = https://bit.ly/2yT9oAU
# ---
# OUR CODE GOES BELOW
# 
banknotes_diagonal=banknotes[['Diagonal']]
banknotes_diagonal.head(20)

    Diagonal
0      141.0
1      141.7
2      142.2
3      142.0
4      141.8
5      141.4
6      141.6
7      141.7
8      141.9
9      140.7
10     141.8
11     142.2
12     141.4
13     141.7
14     141.8
15     141.6
16     141.7
17     141.9
18     141.5
19     141.9

In [15]:
# Challenge 2
# ---
# Select a sample of 10 records from the Diagonal and conterfeit column using the banknotes dataset.
# ---
# OUR CODE GOES BELOW
# 
banknotes[['Diagonal','conterfeit']].sample(10)

     Diagonal  conterfeit
38      142.1           0
124     140.1           1
67      141.5           0
66      141.3           0
3       142.0           0
102     140.2           1
175     139.0           1
189     139.2           1
180     139.1           1
39      141.3           0

In [16]:
# Challenge 3
# ---
# In prepartion for data modeling, you're required to select last 5 colums of the banknotes dataset.
# Once you do so, preview the dataframe to check whether you've selected the columns correctly.
# ---
# OUR CODE GOES BELOW
# 
banknotes.iloc[:,-5:]

      Left  Right  Bottom   Top  Diagonal
0    131.0  131.1     9.0   9.7     141.0
1    129.7  129.7     8.1   9.5     141.7
2    129.7  129.7     8.7   9.6     142.2
3    129.7  129.6     7.5  10.4     142.0
4    129.6  129.7    10.4   7.7     141.8
..     ...    ...     ...   ...       ...
195  130.4  130.3     9.9  12.1     139.6
196  130.3  129.9    10.3  11.5     139.7
197  130.3  130.4    10.6  11.1     140.0
198  130.7  130.8    11.2  11.2     139.4
199  129.9  129.9    10.2  11.5     139.6

[200 rows x 5 columns]

## 3. Selecting Columns II

### Examples

In [17]:
# Selecting Unique Values in a column
# --- 
# Let's select unique values from the Country column in the ebola dataset
# ---
# 
ebola_countries = ebola_df['Country'].unique() 

# We use the list() method to get a list else
# we would get an array.
# ---
#
list(ebola_countries)

['Guinea', 'Liberia', 'Mali', 'Senegal', 'Sierra Leone']

In [18]:
# Selecting Rows with Columns with certain values
# ---
# We will select all Liberia records
# 
liberia_records = ebola_df[ebola_df.Country.isin(['Mali'])]
liberia_records

   Country  Month  Year    Lat  Lon  Value
19    Mali     10    14  17.57 -4.0    1.0
20    Mali     11    14  17.57 -4.0    8.0

In [19]:
# Selecting Records with Columns without certain values
# ---
# We will select all other records apart from the Liberia ones.
# Let's confirm our result by checking a sample of 10 records.
# ---
#
other_country_records = ebola_df[~ebola_df.Country.isin(['Liberia'])]
other_country_records.sample(15)

         Country  Month  Year    Lat    Lon   Value
3         Guinea      6    14   9.95  -9.70   413.0
26  Sierra Leone      8    14   8.46 -11.78  1216.0
29  Sierra Leone     11    14   8.46 -11.78     NaN
21       Senegal      8    14  14.50 -14.45     1.0
22       Senegal      9    14  14.50 -14.45     3.0
24  Sierra Leone      6    14   8.46 -11.78   239.0
1         Guinea      4    14   9.95  -9.70   224.0
27  Sierra Leone      9    14   8.46 -11.78  1940.0
2         Guinea      5    14   9.95  -9.70   291.0
30  Sierra Leone     12    14   8.46 -11.78     NaN
4         Guinea      7    14   9.95  -9.70   460.0
25  Sierra Leone      7    14   8.46 -11.78   533.0
5         Guinea      8    14   9.95  -9.70   771.0
8         Guinea     11    14   9.95  -9.70     NaN
20          Mali     11    14  17.57  -4.00     8.0

### <font color="green">Challenges</font>

In [20]:
# Challenge 1
# ---
# Select and preview the unique length values in banknotes?
# ---
# Dataset url = https://bit.ly/2yT9oAU
# ---
# 
banknotes['Length'].unique()

array([214.8, 214.6, 215. , 215.7, 215.5, 214.5, 214.9, 215.2, 215.3,
       215.1, 214.7, 215.6, 215.9, 213.9, 214.4, 214.3, 215.4, 213.8,
       214.1, 214.2, 216.3])

In [21]:
# Challenge 2
# ---
# How many banknotes had a left measurement and right measurement greater than 129?
# Get a sample of the records and later determine the no.
# Hint: Sample  Use len() to determine the no. of items.
# ---
# 
banknotes_sample.__len__(129)

TypeError: __len__() takes 1 positional argument but 2 were given

## 4. Ranking / Sorting

### Examples

In [ ]:
# Sorting in Ascending / Descending Order 
# ---
# From the ebola dataset sort the Guinea records in descending order
# ---
# OUR CODE GOES BELOW
# 
guinea_records = ebola_df[ebola_df.Country.isin(['Guinea'])].sort_values(by='Value', ascending=1)
guinea_records.head()

In [ ]:
# Ranking in Ascending Order
# ---
# Create a new column that is the rank of the value of 'Value' in descending order
# ---
# 
ebola_df['Ranking'] = ebola_df['Value'].rank(ascending=0)
ebola_df.head()

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# From the ebola dataset, select the Mali records with more 
# than 100 cases and sort them in descending order. 
# ---
#

In [ ]:
# Challenge 2
# ---
# From the banknotes dataset, find out which records had the largest 
# diagonal length? In addition, rank them by left size.
# --- 
# Dataset url = https://bit.ly/2yT9oAU
# ---
#

## 5. Aggregate Functions

### Examples

In [22]:
# Example 1
# ---
# Shape
# ---
# How many Liberian records do we have in our ebola dataset?
# ---
# (records, columns)
#
liberia_records = ebola_df[ebola_df.Country.isin(['Liberia'])]
liberia_records.shape

# (9 records, 6 columns)

(9, 6)

In [23]:
# Example 2
# ---
# Count() Function
# ---
# How many values do we have accoss our variables in our ebola dataset?
# ---
#
liberia_records = ebola_df[ebola_df.Country.isin(['Liberia'])]
liberia_records.count()

Country    9
Month      9
Year       9
Lat        9
Lon        9
Value      6
dtype: int64

In [ ]:
# Example 3
# ---
# Unique Occurrences
# ---
# Were all records in our ebola dataset unique?
# ---
# 
ebola_df[ebola_df.duplicated()].shape

# Yes, there were no duplicate records

In [ ]:
# Example 4
# ---
# Sum
# ---
# How many ebola cases in Sierra Leone were reported given the ebola dataset?
# ---
# 
sierra_cases_sum = ebola_df[ebola_df.Country.isin(['Sierra Leone'])][['Value']].sum() 
sierra_cases_sum

In [ ]:
# Example 5
# ---
# Minimum
# ---
# Which record had the least no of ebola cases?
# ---
# 
least_cases = ebola_df.min()
least_cases

In [ ]:
# Maximum
# ---
# Which record had the highest no of ebola cases?
# ---
# 
highest_cases = ebola_df.max()
highest_cases

In [ ]:
# Mean
# ---
# What was the average number of ebola cases in Sierra Leone?
# ---
# 
sierra_cases_avg = ebola_df[ebola_df.Country.isin(['Sierra Leone'])][['Value']].mean() 
sierra_cases_avg

In [ ]:
# Mode
# ---
# What was the most frequent value in the Ebola dataset?
# ---
# 
frequent_values_df = ebola_df['Country'].mode() 
frequent_values_df

In [ ]:
# Median
# ---
# The median value of the Ebola cases.
# ---
# 
median_values_df = ebola_df['Value'].median() 
median_values_df

In [ ]:
# Summary Statistics
# ---
# Create a descriptive statistics table of the given ebola dataset 
# in preparation for further analysis.
# ---
# 
ebola_df.describe()

### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# How many records can be found in the following insurance dataset?
# ---
# Insurance Dataset url = https://bit.ly/2y5CRYc
# ---
# This dataset contains anonymised patient data.
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 2
# ---
# Are there any duplicates in the insurance dataset?
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 3
# ---
# Which regions did the patients come from?
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 4
# ---
# What was the highest bmi recorded for patients from northwest and southwest regions?
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 5
# ---
# What was the youngest age of a patient?
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 6
# ---
# What was the average bmi recorded for patients above 50 years old?
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 7
# ---
# How much was spent collectively by male and female patients?
# ---
# OUR CODE GOES BELOW
#

## 6. Grouping

### Examples

In [ ]:
# Let's first load and preview the dataset that we will need for our examples 
# ---
#
insurance_df = pd.read_csv('https://bit.ly/2y5CRYc')
insurance_df.head()

In [ ]:
# Example 1
# ---
# The groupby() function is used to split the data into groups based on some criteria.
# ---
# We will start by grouping by a single column and including an aggregate function as shown.
# ---
# NB: We will not store any our dataframe in a variable for ease of
# performing computations
# ---
#
insurance_df.groupby('region').mean()

In [ ]:
# Example 2
# ---
# We can get the first entry for each gender by doing the following
# ---
# NB: You can also get the last one too using last()
# ---
# 
insurance_df.groupby('sex').first()

In [ ]:
# Example 3
# ---
# We can group a single column by another column then apply an aggregate function as shown
# ---
# 
insurance_df['expenses'].groupby([insurance_df['sex']]).sum()

# Method 2
# ---
# NB: The groupby output will have an index or multi-index on rows corresponding 
# to our chosen grouping variables. To avoid setting this index, 
# we pass “as_index = False” to the groupby operation
# ---
# insurance_df.groupby('sex', as_index = False)['expenses'].sum()

In [ ]:
# Example 4
# ---
# We can group the region column by another column i.e. bmi then apply an aggregate function
# as shown
# ---
#
insurance_df['bmi'].groupby([insurance_df['region']]).mean()

# Method 2
# ---
# insurance_df.groupby('region', as_index = False)['bmi'].mean()

In [ ]:
# Example 5
# ---
# We can create a summary statistical table as shown below
# ---
insurance_df['expenses'].groupby([insurance_df['region']]).describe()

# Method 2
# ---
# insurance_df.groupby('region', as_index = False)['expenses'].describe()

In [ ]:
# Example 6
# ---
# Further seeing how we can group a column by another column as shown 
# 
insurance_df['children'].groupby([insurance_df['region']]).sum()

# Method 2
# ---
#
# insurance_df.groupby('region', as_index = False)['children'].sum()

In [ ]:
# Example 7
# ---
# Applying multiple aggregate functions after grouping a column by another column
# ---
# 
insurance_df['expenses'].groupby([insurance_df['region']]).agg([min, max, sum])

# Method 2
# insurance_df.groupby(['region'], as_index = False).agg({'expenses': [min, max, sum] })

In [ ]:
# Example 8
# ---
# We can also apply multiple aggregate functions after grouping a column by another column
# ---
# 
insurance_df.groupby(['region', 'sex'], as_index = False).agg({'expenses': [min, max, sum] })

In [ ]:
# Example 9
# ---
# Grouping by of multiple columns and then applying an aggregate function
# ---
# 
insurance_df['expenses'].groupby([insurance_df['region'], insurance_df['sex']]).sum()

# Method 2
# ---
# insurance_df.groupby(['region', 'sex'], as_index = False)['expenses'].sum()

# Method 3
# ---
# insurance_df.groupby(['region', 'sex']).agg({'expenses': ['sum']})

### <font color="green">Challenges</font>

In [ ]:
# Let's load and preview the dataset that we will use for the given challenges.
# ---
# The dataset contains customer invoice data.
# ---
# Dataset url = https://bit.ly/SuperMarketSalesDB
# ---
#

In [ ]:
# Challenge 1
# ---
# Question: What was the average tax per city?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 2
# ---
# Question: How much did female members from the city of Yagon spend?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 3
# ---
# Question: How much was spent across all cities?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 4
# ---
# Question: What was the sum of goods sold across all branches?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 5
# ---
# Question: Which branches collected the most amount of money? 
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 6
# ---
# Question: Which were the top rated branches?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 7
# ---
# Question: Make a comparison between non-members who made cash payments and credit card payments.
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 8
# ---
# Question: Show the products line that sold the most indicating the rating.
# ---
# OUR CODE GOES BELOW 
#

## 7. Pivot Tables

### Examples

In [ ]:
# Example 1
# ---
# A pivot tables is a summary table and comprises of 
# outcomes similar to the group by tables.
# --- 
# We will start working with pivot tables by getting one column 
# and applying an aggregate function as shown below
# ---
# 
pd.pivot_table(insurance_df, index=['region'], aggfunc='mean')

In [ ]:
# Example 2
# ---
# Getting the first entry for each gender
# NB: You can get the last one too using last().
# In addition, note the that the columns have been arranged alphabetically.
# ---
# 
pd.pivot_table(insurance_df, index=['sex'], aggfunc='first')

In [ ]:
# Example 3
# ---
# We can group a single column by another column then apply an aggregate function as shown
# ---
# We will use numpy to compute the mean
#
pd.pivot_table(insurance_df, index=['sex'], aggfunc={'expenses': np.mean})

In [ ]:
# Example 4
# ---
# Grouping region by another column i.e. bmi, applying an aggregate function
# ---
#
pd.pivot_table(insurance_df, index=['region'], aggfunc={'bmi': np.mean})

In [ ]:
# Example 5
# ---
# Using a pivote table, we can also create a summary statistical table as shown below
# ---
#
pd.pivot_table(insurance_df, index=['region'], aggfunc={'expenses': 'describe'})

In [ ]:
# Example 6
# ---
# Getting the no. of children in each region
# ---
#  
# 
pd.pivot_table(insurance_df, index=['region'], aggfunc={'children': sum})

In [ ]:
# Example 6
# ---
# Applying multiple aggregate functions to a group
# ---
# 
pd.pivot_table(insurance_df, index=['region', 'sex'], aggfunc={'expenses': [min, max, sum]})

In [ ]:
# Example 7
# ---
# Applying multiple aggregate functions to a group
# ---
# 
pd.pivot_table(insurance_df, index=['region', 'sex'], aggfunc={'expenses': sum})

### <font color="green">Challenges</font>

The challenges in this section will be same as the ones group by challenges. Compare your solutions with the ones you got in the previous section.

In [ ]:
# You will use the supermarket dataset you previously used. 
# ---
# The dataset contains customer invoice data.
# ---
# Dataset url = https://bit.ly/SuperMarketSalesDB
# ---
#

In [ ]:
# Challenge 1
# ---
# Question: What was the average tax per city?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 2
# ---
# Question: How much did female members from the city of Yagon spend?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 3
# ---
# Question: How much was spent across all cities?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 4
# ---
# Question: What was the sum of goods sold across all branches?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 5
# ---
# Question: Which branches collected the most amount of money? 
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 6
# ---
# Question: Which were the top rated branches?
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 7
# ---
# Question: Make a comparison between non-members who made cash payments and credit card payments.
# ---
# OUR CODE GOES BELOW 
#

In [ ]:
# Challenge 8
# ---
# Question: Show the products line that sold the most indicating the rating.
# ---
# OUR CODE GOES BELOW 
#